{
  "format": "graph-model",
  "generatedBy": "https://github.com/HSE-asavchenko/face-emotion-recognition",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}
      },
      "outputs":
      {
          "emotion_preds": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"7"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model_2/conv1_pad/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_2/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_4/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_6/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_12/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model_2/global_pooling/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model_2/feats/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/feats/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/emotion_preds/MatMul/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"},{"size":"7"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/emotion_preds/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"7"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv1/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_12/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_2/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_2/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_12/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_3/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_3/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_4/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_4/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_5/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_5/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_6/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_6/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_13/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_7/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_7/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_13/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_8/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_8/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_9/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_9/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_10/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_10/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_11/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_11/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model_2/conv1_pad/Pad","op":"Pad","input":["input_1","StatefulPartitionedCall/model_2/conv1_pad/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model_2/conv1_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv1_pad/Pad","StatefulPartitionedCall/model_2/conv1/Conv2D_weights","StatefulPartitionedCall/model_2/conv1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_host_args":{"i":"0"},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","2","2","1"]}},"num_args":{"i":"1"},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"TArgs":{"list":{"type":["DT_FLOAT"]}},"padding":{"s":"VkFMSUQ="},"filter_format":{"s":"SFdJTw=="},"explicit_paddings":{"list":{}},"leakyrelu_alpha":{"f":0.2}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_1/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv1_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_1/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_1/depthwise_bn_offset"],"attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_1_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_1/depthwise","StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"leakyrelu_alpha":{"f":0.2},"data_format":{"s":"TkhXQw=="},"filter_format":{"s":"SFdJTw=="},"num_host_args":{"i":"0"},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"TArgs":{"list":{"type":["DT_FLOAT"]}},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_2/Pad","op":"Pad","input":["StatefulPartitionedCall/model_2/conv_pw_1_relu/Relu6","StatefulPartitionedCall/model_2/conv_pad_2/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_2/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pad_2/Pad","StatefulPartitionedCall/model_2/conv_dw_2/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_2/depthwise_bn_offset"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_2_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_2/depthwise","StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_host_args":{"i":"0"},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"filter_format":{"s":"SFdJTw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"TArgs":{"list":{"type":["DT_FLOAT"]}},"leakyrelu_alpha":{"f":0.2}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_3/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_2_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_3/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_3/depthwise_bn_offset"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_3_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_3/depthwise","StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"leakyrelu_alpha":{"f":0.2},"filter_format":{"s":"SFdJTw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"num_host_args":{"i":"0"},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"TArgs":{"list":{"type":["DT_FLOAT"]}},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_4/Pad","op":"Pad","input":["StatefulPartitionedCall/model_2/conv_pw_3_relu/Relu6","StatefulPartitionedCall/model_2/conv_pad_4/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_4/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pad_4/Pad","StatefulPartitionedCall/model_2/conv_dw_4/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_4/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_4_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_4/depthwise","StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"TArgs":{"list":{"type":["DT_FLOAT"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"epsilon":{"f":0},"num_host_args":{"i":"0"},"strides":{"list":{"i":["1","1","1","1"]}},"leakyrelu_alpha":{"f":0.2},"use_cudnn_on_gpu":{"b":true},"filter_format":{"s":"SFdJTw=="},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_5/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_4_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_5/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_5/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_5_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_5/depthwise","StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"TArgs":{"list":{"type":["DT_FLOAT"]}},"leakyrelu_alpha":{"f":0.2},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"num_host_args":{"i":"0"},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"filter_format":{"s":"SFdJTw=="},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_6/Pad","op":"Pad","input":["StatefulPartitionedCall/model_2/conv_pw_5_relu/Relu6","StatefulPartitionedCall/model_2/conv_pad_6/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_6/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pad_6/Pad","StatefulPartitionedCall/model_2/conv_dw_6/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_6/depthwise_bn_offset"],"attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_6_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_6/depthwise","StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_host_args":{"i":"0"},"TArgs":{"list":{"type":["DT_FLOAT"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"leakyrelu_alpha":{"f":0.2},"filter_format":{"s":"SFdJTw=="}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_7/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_6_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_7/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_7/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_7_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_7/depthwise","StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"TArgs":{"list":{"type":["DT_FLOAT"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"filter_format":{"s":"SFdJTw=="},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"num_host_args":{"i":"0"},"epsilon":{"f":0},"leakyrelu_alpha":{"f":0.2},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_8/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_7_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_8/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_8/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_8_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_8/depthwise","StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"leakyrelu_alpha":{"f":0.2},"filter_format":{"s":"SFdJTw=="},"TArgs":{"list":{"type":["DT_FLOAT"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"num_host_args":{"i":"0"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_9/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_8_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_9/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_9/depthwise_bn_offset"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_9_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_9/depthwise","StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"TArgs":{"list":{"type":["DT_FLOAT"]}},"leakyrelu_alpha":{"f":0.2},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"num_host_args":{"i":"0"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"filter_format":{"s":"SFdJTw=="},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_10/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_9_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_10/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_10/depthwise_bn_offset"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_10_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_10/depthwise","StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_host_args":{"i":"0"},"epsilon":{"f":0},"data_format":{"s":"TkhXQw=="},"filter_format":{"s":"SFdJTw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"TArgs":{"list":{"type":["DT_FLOAT"]}},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}},"leakyrelu_alpha":{"f":0.2}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_11/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_10_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_11/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_11/depthwise_bn_offset"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_11_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_11/depthwise","StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"filter_format":{"s":"SFdJTw=="},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"TArgs":{"list":{"type":["DT_FLOAT"]}},"leakyrelu_alpha":{"f":0.2},"strides":{"list":{"i":["1","1","1","1"]}},"num_host_args":{"i":"0"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pad_12/Pad","op":"Pad","input":["StatefulPartitionedCall/model_2/conv_pw_11_relu/Relu6","StatefulPartitionedCall/model_2/conv_pad_12/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_12/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pad_12/Pad","StatefulPartitionedCall/model_2/conv_dw_12/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_12/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_12_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_12/depthwise","StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_host_args":{"i":"0"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"TArgs":{"list":{"type":["DT_FLOAT"]}},"data_format":{"s":"TkhXQw=="},"filter_format":{"s":"SFdJTw=="},"leakyrelu_alpha":{"f":0.2},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_2/conv_dw_13/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model_2/conv_pw_12_relu/Relu6","StatefulPartitionedCall/model_2/conv_dw_13/depthwise_weights","StatefulPartitionedCall/model_2/conv_dw_13/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/conv_pw_13_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_2/conv_dw_13/depthwise","StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_weights","StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"filter_format":{"s":"SFdJTw=="},"TArgs":{"list":{"type":["DT_FLOAT"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"num_host_args":{"i":"0"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"leakyrelu_alpha":{"f":0.2},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model_2/global_pooling/Mean","op":"Mean","input":["StatefulPartitionedCall/model_2/conv_pw_13_relu/Relu6","StatefulPartitionedCall/model_2/global_pooling/Mean/reduction_indices"],"attr":{"Tidx":{"type":"DT_INT32"},"keep_dims":{"b":false},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_2/feats/Relu","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_2/global_pooling/Mean","StatefulPartitionedCall/model_2/feats/MatMul/ReadVariableOp","StatefulPartitionedCall/model_2/feats/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"},"epsilon":{"f":0},"leakyrelu_alpha":{"f":0.2},"transpose_a":{"b":false},"transpose_b":{"b":false}}},
          {"name":"StatefulPartitionedCall/model_2/emotion_preds/BiasAdd","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_2/feats/Relu","StatefulPartitionedCall/model_2/emotion_preds/MatMul/ReadVariableOp","StatefulPartitionedCall/model_2/emotion_preds/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"transpose_b":{"b":false},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"transpose_a":{"b":false},"leakyrelu_alpha":{"f":0.2}}},
          {"name":"StatefulPartitionedCall/model_2/emotion_preds/Softmax","op":"Softmax","input":["StatefulPartitionedCall/model_2/emotion_preds/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Identity","op":"Identity","input":["StatefulPartitionedCall/model_2/emotion_preds/Softmax"],"attr":{"T":{"type":"DT_FLOAT"}}}
      ],
      "library": {},
      "versions":
      {
          "producer": 1286
      }
  },
  "weightsManifest":
  [
      {
          "paths": ["affectnet-mobilenet.bin"],
          "weights": [{"name":"StatefulPartitionedCall/model_2/conv1_pad/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/conv_pad_2/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/conv_pad_4/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/conv_pad_6/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/conv_pad_12/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/global_pooling/Mean/reduction_indices","shape":[2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_2/feats/MatMul/ReadVariableOp","shape":[1024,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/feats/BiasAdd/ReadVariableOp","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/emotion_preds/MatMul/ReadVariableOp","shape":[256,7],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/emotion_preds/BiasAdd/ReadVariableOp","shape":[7],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv1/Conv2D_weights","shape":[3,3,3,32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv1/Conv2D_bn_offset","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_1/depthwise_weights","shape":[3,3,32,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_1/depthwise_bn_offset","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_weights","shape":[1,1,32,64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_1/Conv2D_bn_offset","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_12/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_2/depthwise_weights","shape":[3,3,64,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_2/depthwise_bn_offset","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_weights","shape":[1,1,64,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_2/Conv2D_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_12/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_3/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_3/depthwise_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_weights","shape":[1,1,128,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_3/Conv2D_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_4/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_4/depthwise_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_weights","shape":[1,1,128,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_weights","shape":[1,1,512,1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_4/Conv2D_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_5/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_5/depthwise_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_12/Conv2D_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_5/Conv2D_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_6/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_6/depthwise_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_weights","shape":[1,1,256,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_6/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_13/depthwise_weights","shape":[3,3,1024,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_7/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_7/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_7/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_13/depthwise_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_8/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_8/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_8/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_9/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_9/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_weights","shape":[1,1,1024,1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_9/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_10/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_10/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_13/Conv2D_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_10/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_11/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_dw_11/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_2/conv_pw_11/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}}]
      }
  ]
}