{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}
      },
      "outputs":
      {
          "Identity": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"2254"},{"size":"12"}]}},
          "Identity_1": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"2254"},{"size":"1"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"depthwise_23/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}}}},
          {"name":"model_1/model/depthwise_conv2d_23/BiasAdd_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/depthwise_conv2d_23/depthwise_model_1/model/depthwise_conv2d_23/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_40/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/regressor_person_8_NO_PRUNING/BiasAdd_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/regressor_person_8_NO_PRUNING/Conv2D_model_1/model/regressor_person_8_NO_PRUNING/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"model_1/model/reshaped_regressor_person_8/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"depthwise_25/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/depthwise_conv2d_25/BiasAdd_model_1/model/depthwise_conv2d_25/depthwise_model_1/model/depthwise_conv2d_25/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"Conv2D_42/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/regressor_person_16_NO_PRUNING/BiasAdd_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/regressor_person_16_NO_PRUNING/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"model_1/model/reshaped_regressor_person_16/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"depthwise_27/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_44/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"72"}]}}}}},
          {"name":"model_1/model/reshaped_regressor_person_32/Reshape/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}}}},
          {"name":"Identity/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model_1/model/batch_normalization_54/FusedBatchNormV3_model_1/model/conv2d_38/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_53/FusedBatchNormV3_model_1/model/conv2d_38/Conv2D_model_1/model/conv2d_37/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_5/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"40"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_11/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_11/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model_1/model/up_sampling2d_1/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D_36/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"96"}]}}}}},
          {"name":"Add_37/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"depthwise_20/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_37/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_21/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_38/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_5/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_22/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/depthwise_conv2d_22/BiasAdd_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/depthwise_conv2d_22/depthwise_model_1/model/depthwise_conv2d_22/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_39/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"2"}]}}}}},
          {"name":"model_1/model/classifier_person_8_NO_PRUNING/BiasAdd_model_1/model/classifier_person_16_NO_PRUNING/Conv2D_model_1/model/classifier_person_8_NO_PRUNING/Conv2D_model_1/model/classifier_person_8_NO_PRUNING/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/reshaped_classifier_person_8/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model_1/model/batch_normalization_50/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_49/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D_model_1/model/conv2d_33/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_12/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"112"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_24/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_24/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"Conv2D_33/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_34/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_18/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_34/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"depthwise_19/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"Conv2D_35/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_6/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_24/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/depthwise_conv2d_24/BiasAdd_model_1/model/depthwise_conv2d_25/depthwise_model_1/model/depthwise_conv2d_24/depthwise_model_1/model/depthwise_conv2d_24/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"Conv2D_41/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/classifier_person_16_NO_PRUNING/BiasAdd_model_1/model/classifier_person_16_NO_PRUNING/Conv2D_model_1/model/classifier_person_16_NO_PRUNING/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/reshaped_classifier_person_16/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model_1/model/batch_normalization_44/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D_model_1/model/conv2d_29/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Conv2D_30/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_30/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"depthwise_16/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_31/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_31/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"model_1/model/batch_normalization_41/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D_model_1/model/conv2d_27/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Conv2D_28/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_28/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_15/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_29/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_29/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"model_1/model/batch_normalization_38/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D_model_1/model/conv2d_25/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"Conv2D_26/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_26/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"depthwise_14/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_27/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"Conv2D_27/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_32/FusedBatchNormV3_model_1/model/depthwise_conv2d_16/depthwise_model_1/model/conv2d_21/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_21/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_21/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_11/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_22/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_22/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}}}},
          {"name":"model_1/model/batch_normalization_29/FusedBatchNormV3_model_1/model/depthwise_conv2d_16/depthwise_model_1/model/conv2d_19/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_19/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"Add_19/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"depthwise_10/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_20/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_20/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_23/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}}}},
          {"name":"Conv2D_15/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}}}},
          {"name":"Add_15/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_8/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"480"},{"size":"1"}]}}}}},
          {"name":"Add_16/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_16/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"80"}]}}}}},
          {"name":"model_1/model/batch_normalization_20/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_13/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_13/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}}}},
          {"name":"Add_13/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_7/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"480"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_14/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_14/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}}}},
          {"name":"Conv2D_8/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_8/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_4/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"240"},{"size":"1"}]}}}}},
          {"name":"Add_9/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_4/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"depthwise_2/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"144"},{"size":"1"}]}}}}},
          {"name":"Add_5/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"Conv2D_5/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"24"}]}}}}},
          {"name":"model_1/model/zero_padding2d/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"Conv2D/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}}}},
          {"name":"Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"depthwise/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}}}},
          {"name":"Add_1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_1/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"16"}]}}}}},
          {"name":"model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_2/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_2/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model_1/model/zero_padding2d_1/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"depthwise_1/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_3/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_3/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"24"}]}}}}},
          {"name":"model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_6/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}}}},
          {"name":"Add_6/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_2/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_3/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"144"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"Conv2D_7/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}}}},
          {"name":"Conv2D_10/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_10/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_3/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_6/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"240"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_12/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_12/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"80"}]}}}}},
          {"name":"model_1/model/batch_normalization_17/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_11/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}}}},
          {"name":"Conv2D_17/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}}}},
          {"name":"Add_17/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_9/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"480"},{"size":"1"}]}}}}},
          {"name":"Add_18/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}}}},
          {"name":"Conv2D_18/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"112"}]}}}}},
          {"name":"model_1/model/batch_normalization_26/FusedBatchNormV3_model_1/model/depthwise_conv2d_16/depthwise_model_1/model/conv2d_17/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_23/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"Add_23/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"model_1/model/zero_padding2d_4/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_13/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"Add_25/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"Conv2D_25/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_35/FusedBatchNormV3_model_1/model/conv2d_34/Conv2D_model_1/model/conv2d_23/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_32/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_32/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_17/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"Add_33/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"model_1/model/zero_padding2d_7/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"depthwise_26/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"model_1/model/depthwise_conv2d_26/BiasAdd_model_1/model/depthwise_conv2d_27/depthwise_model_1/model/depthwise_conv2d_26/depthwise_model_1/model/depthwise_conv2d_26/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"Conv2D_43/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"6"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/classifier_person_32_NO_PRUNING/BiasAdd_model_1/model/classifier_person_32_NO_PRUNING/Conv2D_model_1/model/classifier_person_32_NO_PRUNING/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"6"}]}}}}},
          {"name":"model_1/model/reshaped_classifier_person_32/Reshape/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Identity_1/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"224"},{"size":"224"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d/Pad","op":"Pad","input":["input_1","model_1/model/zero_padding2d/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D","op":"Conv2D","input":["model_1/model/zero_padding2d/Pad","Conv2D/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"Add","op":"AddV2","input":["Conv2D","Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d/Conv2D","op":"Relu6","input":["Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise","op":"DepthwiseConv2dNative","input":["model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d/Conv2D","depthwise/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_1","op":"AddV2","input":["depthwise","Add_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D","op":"Relu6","input":["Add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_1","op":"Conv2D","input":["model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/regressor_person_16_NO_PRUNING/Conv2D","Conv2D_1/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1","op":"AddV2","input":["Conv2D_1","model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_2","op":"Conv2D","input":["model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/conv2d_1/Conv2D1","Conv2D_2/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}}}},
          {"name":"Add_2","op":"AddV2","input":["Conv2D_2","Add_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_2/Conv2D","op":"Relu6","input":["Add_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_1/Pad","op":"Pad","input":["model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_2/Conv2D","model_1/model/zero_padding2d_1/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"depthwise_1","op":"DepthwiseConv2dNative","input":["model_1/model/zero_padding2d_1/Pad","depthwise_1/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_3","op":"AddV2","input":["depthwise_1","Add_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise","op":"Relu6","input":["Add_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_3","op":"Conv2D","input":["model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise","Conv2D_3/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1","op":"AddV2","input":["Conv2D_3","model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_4","op":"Conv2D","input":["model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1","Conv2D_4/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Add_4","op":"AddV2","input":["Conv2D_4","Add_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_4/Conv2D","op":"Relu6","input":["Add_4"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_2","op":"DepthwiseConv2dNative","input":["model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_4/Conv2D","depthwise_2/filter_in"],"attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"Add_5","op":"AddV2","input":["depthwise_2","Add_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_2/depthwise","op":"Relu6","input":["Add_5"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_5","op":"Conv2D","input":["model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/depthwise_conv2d_2/depthwise","Conv2D_5/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN","input":["Conv2D_5","model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_3/Conv2D1"],"attr":{"T":{"type":"DT_FLOAT"},"N":{"i":"2"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true}}},
          {"name":"model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_add","op":"AddV2","input":["model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/regressor_person_16_NO_PRUNING/Conv2D_model_1/model/conv2d_5/Conv2D1/y","model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true}}},
          {"name":"Conv2D_6","op":"Conv2D","input":["model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_add","Conv2D_6/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Add_6","op":"AddV2","input":["Conv2D_6","Add_6/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_6/Relu6_model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_6/Conv2D","op":"Relu6","input":["Add_6"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/zero_padding2d_2/Pad","op":"Pad","input":["model_1/model/re_lu_6/Relu6_model_1/model/batch_normalization_9/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_6/Conv2D","model_1/model/zero_padding2d_2/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_3","op":"DepthwiseConv2dNative","input":["model_1/model/zero_padding2d_2/Pad","depthwise_3/filter_in"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="}}},
          {"name":"Add_7","op":"AddV2","input":["depthwise_3","Add_7/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_7/Relu6_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise","op":"Relu6","input":["Add_7"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_7","op":"Conv2D","input":["model_1/model/re_lu_7/Relu6_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise","Conv2D_7/filter"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1","op":"AddV2","input":["Conv2D_7","model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_8","op":"Conv2D","input":["model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1","Conv2D_8/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_8","op":"AddV2","input":["Conv2D_8","Add_8/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_8/Relu6_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_8/Conv2D","op":"Relu6","input":["Add_8"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_4","op":"DepthwiseConv2dNative","input":["model_1/model/re_lu_8/Relu6_model_1/model/batch_normalization_12/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/conv2d_8/Conv2D","depthwise_4/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_9","op":"AddV2","input":["depthwise_4","Add_9/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_9/Relu6_model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/depthwise_conv2d_4/depthwise","op":"Relu6","input":["Add_9"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9","op":"Conv2D","input":["model_1/model/re_lu_9/Relu6_model_1/model/batch_normalization_13/FusedBatchNormV3_model_1/model/batch_normalization_16/FusedBatchNormV3_model_1/model/depthwise_conv2d_5/depthwise_model_1/model/depthwise_conv2d_4/depthwise","Conv2D_9/filter"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}}}},
          {"name":"model_1/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN","input":["Conv2D_9","model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_7/Conv2D1"],"attr":{"T":{"type":"DT_FLOAT"},"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"N":{"i":"2"}}},
          {"name":"model_1/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add","op":"AddV2","input":["model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_9/Conv2D1/y","model_1/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_5","op":"DepthwiseConv2dNative","input":["model_1/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add","depthwise_5/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_10","op":"Conv2D","input":["model_1/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add","Conv2D_10/filter"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"Conv2D_11","op":"Conv2D","input":["depthwise_5","Conv2D_11/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},
          {"name":"Add_10","op":"AddV2","input":["Conv2D_10","Add_10/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Add_11","op":"AddV2","input":["Conv2D_11","Add_11/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
