{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1:0": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}
      },
      "outputs":
      {
          "Identity_4:0": {"name":"Identity_4:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"117"}]}},
          "Identity_1:0": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"}]}},
          "Identity:0": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"195"}]}},
          "Identity_3:0": {"name":"Identity_3:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"64"},{"size":"39"}]}},
          "Identity_2:0": {"name":"Identity_2:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"1"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"Conv2D_44/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"288"},{"size":"195"}]}}}}},
          {"name":"model_1/model/convld_3d/BiasAdd_model_1/model/convld_3d/Conv2D_model_1/model/convld_3d/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"195"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D_46/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/conv_poseflag/BiasAdd_model_1/model/output_segmentation/Conv2D_model_1/model/conv_poseflag/Conv2D_model_1/model/conv_poseflag/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity_1/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model_1/model/batch_normalization_68/FusedBatchNormV3_model_1/model/conv2d_52/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"model_1/model/batch_normalization_67/FusedBatchNormV3_model_1/model/conv2d_52/Conv2D_model_1/model/conv2d_51/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"model_1/model/batch_normalization_66/FusedBatchNormV3_model_1/model/conv2d_52/Conv2D_model_1/model/conv2d_50/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"model_1/model/batch_normalization_65/FusedBatchNormV3_model_1/model/conv2d_52/Conv2D_model_1/model/conv2d_49/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"depthwise_33/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_51/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"8"}]}}}}},
          {"name":"Add_49/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"model_1/model/up_sampling2d_3/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_32/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"Conv2D_50/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"8"}]}}}}},
          {"name":"Add_48/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"depthwise_34/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}}}},
          {"name":"Conv2D_53/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"8"}]}}}}},
          {"name":"depthwise_35/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}}}},
          {"name":"Conv2D_54/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d_4/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_36/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_55/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_37/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_56/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"8"}]}}}}},
          {"name":"Conv2D_57/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}}}},
          {"name":"Identity_2/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_16/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"864"},{"size":"1"}]}}}}},
          {"name":"Conv2D_31/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"864"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_32/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_29/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"88"},{"size":"1"}]}}}}},
          {"name":"Conv2D_47/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_45/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"model_1/model/up_sampling2d_1/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_30/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}}}},
          {"name":"Conv2D_48/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_46/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d_2/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_31/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_49/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"48"}]}}}}},
          {"name":"Add_47/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"Conv2D_52/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"39"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"39"}]}}}}},
          {"name":"model_1/model/batch_normalization_44/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_28/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"864"}]}}}}},
          {"name":"Add_28/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}}}},
          {"name":"depthwise_14/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"864"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_29/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}}}},
          {"name":"Conv2D_29/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"864"},{"size":"144"}]}}}}},
          {"name":"model_1/model/batch_normalization_41/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_27/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_26/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"864"}]}}}}},
          {"name":"Add_26/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_13/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"864"},{"size":"1"}]}}}}},
          {"name":"Add_27/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}}}},
          {"name":"Conv2D_27/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"864"},{"size":"144"}]}}}}},
          {"name":"model_1/model/batch_normalization_38/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_25/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"Conv2D_24/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"864"}]}}}}},
          {"name":"Add_24/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_12/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"864"},{"size":"1"}]}}}}},
          {"name":"Add_25/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}}}},
          {"name":"Conv2D_25/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"864"},{"size":"144"}]}}}}},
          {"name":"model_1/model/batch_normalization_32/FusedBatchNormV3_model_1/model/depthwise_conv2d_17/depthwise_model_1/model/conv2d_21/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"Conv2D_20/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"528"}]}}}}},
          {"name":"Add_20/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}}}},
          {"name":"depthwise_10/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"528"},{"size":"1"}]}}}}},
          {"name":"Add_21/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}}}},
          {"name":"Conv2D_21/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"528"},{"size":"88"}]}}}}},
          {"name":"model_1/model/batch_normalization_29/FusedBatchNormV3_model_1/model/depthwise_conv2d_17/depthwise_model_1/model/conv2d_19/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"Conv2D_18/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"528"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_18/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}}}},
          {"name":"depthwise_9/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"528"},{"size":"1"}]}}}}},
          {"name":"Add_19/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_19/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"528"},{"size":"88"}]}}}}},
          {"name":"model_1/model/batch_normalization_23/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"Conv2D_14/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_14/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_7/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Add_15/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_15/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"64"}]}}}}},
          {"name":"model_1/model/batch_normalization_20/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_13/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_12/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_12/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"depthwise_6/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Add_13/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_13/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"64"}]}}}}},
          {"name":"model_1/model/batch_normalization_14/FusedBatchNormV3_model_1/model/depthwise_conv2d_18/depthwise_model_1/model/conv2d_9/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"Conv2D_8/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}}}},
          {"name":"Add_8/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"depthwise_4/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_9/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_9/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_5/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_4/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_4/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"depthwise_2/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"144"},{"size":"1"}]}}}}},
          {"name":"Add_5/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_5/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"24"}]}}}}},
          {"name":"model_1/model/tf_op_layer_stem/Pad/stem/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"Conv2D/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}}}},
          {"name":"Add/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"depthwise/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}}}},
          {"name":"Add_1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_1/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"16"}]}}}}},
          {"name":"model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_32/depthwise_model_1/model/conv2d_1/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_2/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"64"}]}}}}},
          {"name":"Add_2/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"model_1/model/tf_op_layer_blocks_1/Pad/blocks_1/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_1/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"Add_3/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_3/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_3/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"Conv2D_6/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}}}},
          {"name":"Add_6/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"model_1/model/tf_op_layer_blocks_3/Pad/blocks_3/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_3/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"144"},{"size":"1"}]}}}}},
          {"name":"Add_7/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"Conv2D_7/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"32"}]}}}}},
          {"name":"model_1/model/batch_normalization_11/FusedBatchNormV3_model_1/model/depthwise_conv2d_18/depthwise_model_1/model/conv2d_7/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"Conv2D_10/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"192"}]}}}}},
          {"name":"Add_10/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/tf_op_layer_blocks_5/Pad/blocks_5/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_5/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"Add_11/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_11/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_17/FusedBatchNormV3_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_11/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_16/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"384"}]}}}}},
          {"name":"Add_16/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_8/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"Add_17/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_17/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"88"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_26/FusedBatchNormV3_model_1/model/depthwise_conv2d_17/depthwise_model_1/model/conv2d_17/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"88"}]}}}}},
          {"name":"Conv2D_22/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"88"},{"size":"528"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_22/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}}}},
          {"name":"model_1/model/tf_op_layer_blocks_11/Pad/blocks_11/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"depthwise_11/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"528"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_23/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"528"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_23/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"528"},{"size":"144"}]}}}}},
          {"name":"model_1/model/batch_normalization_35/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_23/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_30/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"864"}]}}}}},
          {"name":"Add_30/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_15/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"864"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_31/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"864"}]}}}}},
          {"name":"depthwise_17/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"864"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_32/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"864"},{"size":"288"}]}}}}},
          {"name":"Add_33/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_18/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_33/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_52/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_36/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"depthwise_19/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_34/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_53/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_37/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_20/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_35/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_54/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_38/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"depthwise_21/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_36/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_55/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_39/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_22/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_37/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_56/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_40/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"depthwise_23/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_38/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_57/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_41/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"depthwise_24/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_39/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_58/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_42/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_25/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_40/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_59/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_43/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_26/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_41/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_60/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_44/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"depthwise_27/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_42/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_61/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D_model_1/model/conv2d_45/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_28/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_43/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_62/FusedBatchNormV3_model_1/model/conv2d_46/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_45/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"288"},{"size":"117"}]}}}}},
          {"name":"model_1/model/convworld_3d/BiasAdd_model_1/model/convworld_3d/Conv2D_model_1/model/convworld_3d/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"117"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity_4/shape","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}}},
          {"name":"model_1/model/tf_op_layer_stem/Pad/stem/Pad","op":"Pad","input":["input_1","model_1/model/tf_op_layer_stem/Pad/stem/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D","op":"Conv2D","input":["model_1/model/tf_op_layer_stem/Pad/stem/Pad","Conv2D/filter"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"Add","op":"Add","input":["Conv2D","Add/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d/Conv2D","op":"Relu6","input":["Add"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise","op":"DepthwiseConv2dNative","input":["model_1/model/re_lu/Relu6_model_1/model/batch_normalization/FusedBatchNormV3_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d/Conv2D","depthwise/filter_in"],"attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_1","op":"Add","input":["depthwise","Add_1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/depthwise_conv2d_19/depthwise","op":"Relu6","input":["Add_1"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_1","op":"Conv2D","input":["model_1/model/re_lu_1/Relu6_model_1/model/batch_normalization_1/FusedBatchNormV3_model_1/model/depthwise_conv2d/depthwise_model_1/model/depthwise_conv2d_19/depthwise","Conv2D_1/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_32/depthwise_model_1/model/conv2d_1/Conv2D1","op":"Add","input":["Conv2D_1","model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_32/depthwise_model_1/model/conv2d_1/Conv2D1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_32","op":"DepthwiseConv2dNative","input":["model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_32/depthwise_model_1/model/conv2d_1/Conv2D1","depthwise_32/filter_in"],"attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"Conv2D_2","op":"Conv2D","input":["model_1/model/batch_normalization_2/FusedBatchNormV3_model_1/model/depthwise_conv2d_32/depthwise_model_1/model/conv2d_1/Conv2D1","Conv2D_2/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"Conv2D_50","op":"Conv2D","input":["depthwise_32","Conv2D_50/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"Add_2","op":"Add","input":["Conv2D_2","Add_2/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Add_48","op":"Add","input":["Conv2D_50","Add_48/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_2/Conv2D","op":"Relu6","input":["Add_2"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/activation_16/Relu_model_1/model/batch_normalization_63/FusedBatchNormV3_model_1/model/conv2d_52/Conv2D_model_1/model/conv2d_47/Conv2D","op":"Relu","input":["Add_48"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/tf_op_layer_blocks_1/Pad/blocks_1/Pad","op":"Pad","input":["model_1/model/re_lu_2/Relu6_model_1/model/batch_normalization_3/FusedBatchNormV3_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_15/Conv2D_model_1/model/conv2d_2/Conv2D","model_1/model/tf_op_layer_blocks_1/Pad/blocks_1/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_1","op":"DepthwiseConv2dNative","input":["model_1/model/tf_op_layer_blocks_1/Pad/blocks_1/Pad","depthwise_1/filter_in"],"attr":{"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"Add_3","op":"Add","input":["depthwise_1","Add_3/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_15/Conv2D","op":"Relu6","input":["Add_3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_3","op":"Conv2D","input":["model_1/model/re_lu_3/Relu6_model_1/model/batch_normalization_4/FusedBatchNormV3_model_1/model/depthwise_conv2d_1/depthwise_model_1/model/conv2d_15/Conv2D","Conv2D_3/filter"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_3/Conv2D1","op":"Add","input":["Conv2D_3","model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_3/Conv2D1/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_4","op":"Conv2D","input":["model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_3/Conv2D1","Conv2D_4/filter"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"Add_4","op":"Add","input":["Conv2D_4","Add_4/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_4/Conv2D","op":"Relu6","input":["Add_4"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_2","op":"DepthwiseConv2dNative","input":["model_1/model/re_lu_4/Relu6_model_1/model/batch_normalization_6/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_4/Conv2D","depthwise_2/filter_in"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"Add_5","op":"Add","input":["depthwise_2","Add_5/y"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_29/Conv2D_model_1/model/depthwise_conv2d_2/depthwise","op":"Relu6","input":["Add_5"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_5","op":"Conv2D","input":["model_1/model/re_lu_5/Relu6_model_1/model/batch_normalization_7/FusedBatchNormV3_model_1/model/batch_normalization_10/FusedBatchNormV3_model_1/model/depthwise_conv2d_3/depthwise_model_1/model/conv2d_29/Conv2D_model_1/model/depthwise_conv2d_2/depthwise","Conv2D_5/filter"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add","op":"AddN","input":["Conv2D_5","model_1/model/batch_normalization_5/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_3/Conv2D1"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"N":{"i":"2"},"T":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_add","op":"AddV2","input":["model_1/model/batch_normalization_8/FusedBatchNormV3_model_1/model/depthwise_conv2d_19/depthwise_model_1/model/conv2d_5/Conv2D1/y","model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"],"attr":{"_grappler_ArithmeticOptimizer_AddOpsRewriteStage":{"b":true},"T":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_31","op":"DepthwiseConv2dNative","input":["model_1/model/add/ArithmeticOptimizer/AddOpsRewrite_add","depthwise_31/filter_in"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
