{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe/tree/master/mediapipe/modules/pose_detection",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input": {"name":"input:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}
      },
      "outputs":
      {
          "person": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"2254"},{"size":"13"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_22/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_22/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_8_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_8_NO_PRUNING/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_8/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_8/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_8/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_8/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_8/Reshape/shape/2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_24/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_24/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_16_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_16_NO_PRUNING/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_16/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_16/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_16/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_16/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_16/Reshape/shape/2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_26/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_26/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_32_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"6"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/classifier_person_32_NO_PRUNING/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"6"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_32/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_32/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_32/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_32/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_classifier_person_32/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/classifiers_person/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_19/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"40"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/up_sampling2d_1/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_20/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_21/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_5/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_23/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_23/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/regressor_person_8_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/regressor_person_8_NO_PRUNING/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_8/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_8/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_8/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_8/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_8/Reshape/shape/2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_16/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"112"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/up_sampling2d/mul","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_17/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_18/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_6/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_25/depthwise/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_25/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/regressor_person_16_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/regressor_person_16_NO_PRUNING/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_16/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_16/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_16/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_16/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_16/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_1/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_2/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_3/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_4/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_7/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_27/depthwise/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/regressor_person_32_NO_PRUNING/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"72"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_32/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_32/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_32/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_32/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshaped_regressor_person_32/Reshape/shape/2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/regressors_person/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/person/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"input","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"16"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"144"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"144"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"144"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"144"},{"size":"40"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"240"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"40"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"240"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"240"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"240"},{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"480"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"480"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"80"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"80"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"80"},{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"480"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"480"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"480"},{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d/Pad","op":"Pad","input":["input","StatefulPartitionedCall/model/zero_padding2d/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/re_lu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/zero_padding2d/Pad","StatefulPartitionedCall/model/conv2d/Conv2D_weights","StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"epsilon":{"f":0}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/re_lu/Relu6","StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d/depthwise","StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/re_lu_2/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3","StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_1/Pad","op":"Pad","input":["StatefulPartitionedCall/model/re_lu_2/Relu6","StatefulPartitionedCall/model/zero_padding2d_1/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/zero_padding2d_1/Pad","StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_weights","StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_bn_offset"],"attr":{"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise","StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/re_lu_4/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3","StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/re_lu_4/Relu6","StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_weights","StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_bn_offset"],"attr":{"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise","StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"StatefulPartitionedCall/model/add/add","op":"AddV2","input":["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3","StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/re_lu_6/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/add/add","StatefulPartitionedCall/model/conv2d_6/Conv2D_weights","StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"StatefulPartitionedCall/model/zero_padding2d_2/Pad","op":"Pad","input":["StatefulPartitionedCall/model/re_lu_6/Relu6","StatefulPartitionedCall/model/zero_padding2d_2/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
