{
  "format": "graph-model",
  "generatedBy": "https://github.com/google/mediapipe",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1:0": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"256"},{"size":"256"},{"size":"3"}]}}
      },
      "outputs":
      {
          "Identity_1:0": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"}]}},
          "Identity_3:0": {"name":"Identity_3:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"64"},{"size":"64"},{"size":"39"}]}},
          "Identity:0": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"195"}]}},
          "Identity_4:0": {"name":"Identity_4:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"117"}]}},
          "Identity_2:0": {"name":"Identity_2:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"128"},{"size":"128"},{"size":"1"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"Conv2D_102/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"288"},{"size":"195"}]}}}}},
          {"name":"model_1/model/convld_3d/BiasAdd_model_1/model/convld_3d/Conv2D_model_1/model/convld_3d/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"195"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"Conv2D_104/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"model_1/model/conv_poseflag/BiasAdd_model_1/model/output_segmentation/Conv2D_model_1/model/conv_poseflag/Conv2D_model_1/model/conv_poseflag/BiasAdd/ReadVariableOp/resource1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"Identity_1/shape","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_39/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_68/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_68/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d_3/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"depthwise_37/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"24"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_66/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"8"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_67/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"depthwise_73/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}}}},
          {"name":"Conv2D_106/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"8"},{"size":"8"}]}}}}},
          {"name":"Add_103/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"8"}]}}}}},
          {"name":"Conv2D_107/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"8"},{"size":"1"}]}}}}},
          {"name":"Identity_2/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_105/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"39"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Identity_3/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"39"}]}}}}},
          {"name":"model_1/model/batch_normalization_129/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_128/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_98/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_127/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_97/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_126/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_96/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_125/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_95/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_124/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_94/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_123/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_93/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_122/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_92/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_121/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_91/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_120/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_90/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_119/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_89/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_118/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_88/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_117/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_87/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_116/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_86/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_115/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_85/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_114/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_84/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_112/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_82/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_111/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_81/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_110/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_80/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_109/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_79/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_108/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_78/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/batch_normalization_107/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_77/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_106/FusedBatchNormV3_model_1/model/conv2d_99/Conv2D_model_1/model/conv2d_76/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"288"}]}}}}},
          {"name":"model_1/model/channel_padding_2/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"model_1/model/batch_normalization_104/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_74/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_103/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_73/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"model_1/model/batch_normalization_102/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_72/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_101/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_71/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"model_1/model/batch_normalization_100/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_70/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"model_1/model/batch_normalization_99/FusedBatchNormV3_model_1/model/depthwise_conv2d_47/depthwise_model_1/model/conv2d_69/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/channel_padding_1/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"model_1/model/batch_normalization_97/FusedBatchNormV3_model_1/model/depthwise_conv2d_40/depthwise_model_1/model/conv2d_67/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model_1/model/batch_normalization_96/FusedBatchNormV3_model_1/model/depthwise_conv2d_40/depthwise_model_1/model/conv2d_66/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_95/FusedBatchNormV3_model_1/model/depthwise_conv2d_40/depthwise_model_1/model/conv2d_65/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model_1/model/batch_normalization_94/FusedBatchNormV3_model_1/model/depthwise_conv2d_40/depthwise_model_1/model/conv2d_64/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"model_1/model/batch_normalization_93/FusedBatchNormV3_model_1/model/depthwise_conv2d_40/depthwise_model_1/model/conv2d_63/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/channel_padding/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"depthwise_30/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1632"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_59/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"48"}]}}}}},
          {"name":"Add_60/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"model_1/model/up_sampling2d/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_32/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"160"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_61/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_62/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/up_sampling2d_1/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_34/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"56"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_63/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"48"}]}}}}},
          {"name":"Add_64/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"model_1/model/up_sampling2d_2/resize/ResizeBilinear_lambda/resize/size","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"depthwise_36/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_65/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_66/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"depthwise_38/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"1"}]}}}}},
          {"name":"Conv2D_67/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"96"}]}}}}},
          {"name":"depthwise_40/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_69/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_41/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_70/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"depthwise_42/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_71/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}}}},
          {"name":"depthwise_43/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_72/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_35/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"56"},{"size":"1"}]}}}}},
          {"name":"Conv2D_64/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"96"}]}}}}},
          {"name":"Add_65/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_44/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"1"}]}}}}},
          {"name":"Conv2D_73/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_45/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_74/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_46/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_75/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}}}},
          {"name":"depthwise_47/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_76/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_48/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"Conv2D_77/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_49/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_78/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_33/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"160"},{"size":"1"}]}}}}},
          {"name":"Conv2D_62/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_63/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_50/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"Conv2D_79/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"288"}]}}}}},
          {"name":"depthwise_51/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_80/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_52/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_81/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_53/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_82/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_54/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_83/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_55/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}}}},
          {"name":"Conv2D_84/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}}}},
          {"name":"depthwise_56/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"288"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_85/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"288"},{"size":"288"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_86/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_56/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_56/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"depthwise_28/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_57/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_57/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_83/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_55/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_54/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}}}},
          {"name":"Add_54/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"depthwise_27/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}}}},
          {"name":"Add_55/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_55/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_80/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_53/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_52/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_52/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_26/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}}}},
          {"name":"Add_53/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"Conv2D_53/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_77/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_51/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_50/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_50/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_25/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_51/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"Conv2D_51/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}}}},
          {"name":"model_1/model/batch_normalization_74/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_49/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_48/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_48/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"depthwise_24/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}}}},
          {"name":"Add_49/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"Conv2D_49/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}}}},
          {"name":"model_1/model/batch_normalization_71/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_47/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_46/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}}}},
          {"name":"Add_46/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"depthwise_23/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}}}},
          {"name":"Add_47/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"Conv2D_47/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_68/FusedBatchNormV3_model_1/model/conv2d_57/Conv2D_model_1/model/conv2d_45/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"272"}]}}}}},
          {"name":"Conv2D_44/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"272"},{"size":"1632"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_44/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"depthwise_22/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"1632"},{"size":"1"}]}}}}},
          {"name":"Add_45/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1632"}]}}}}},
          {"name":"Conv2D_45/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1632"},{"size":"272"}]}}}}},
          {"name":"model_1/model/batch_normalization_62/FusedBatchNormV3_model_1/model/depthwise_conv2d_46/depthwise_model_1/model/conv2d_41/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_40/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_40/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_20/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"960"},{"size":"1"}]}}}}},
          {"name":"Add_41/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_41/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"960"},{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_59/FusedBatchNormV3_model_1/model/depthwise_conv2d_46/depthwise_model_1/model/conv2d_39/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}}}},
          {"name":"Conv2D_38/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_38/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}}}},
          {"name":"depthwise_19/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"960"},{"size":"1"}]}}}}},
          {"name":"Add_39/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_39/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"960"},{"size":"160"}]}}}}},
          {"name":"model_1/model/batch_normalization_56/FusedBatchNormV3_model_1/model/depthwise_conv2d_46/depthwise_model_1/model/conv2d_37/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}}}},
          {"name":"Conv2D_36/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_36/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}}}},
          {"name":"depthwise_18/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"960"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_37/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_37/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"960"},{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_53/FusedBatchNormV3_model_1/model/depthwise_conv2d_46/depthwise_model_1/model/conv2d_35/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_34/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_34/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_17/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"960"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_35/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}}}},
          {"name":"Conv2D_35/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"960"},{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_50/FusedBatchNormV3_model_1/model/depthwise_conv2d_46/depthwise_model_1/model/conv2d_33/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}}}},
          {"name":"Conv2D_32/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"160"},{"size":"960"}]}}}}},
          {"name":"Add_32/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_16/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"960"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_33/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"960"}]}}}}},
          {"name":"Conv2D_33/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"960"},{"size":"160"}]}}}}},
          {"name":"model_1/model/batch_normalization_44/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_28/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"Add_28/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_14/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"Add_29/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"Conv2D_29/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_41/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_27/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_26/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_26/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_13/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"Add_27/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"Conv2D_27/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_38/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_25/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_24/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_24/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_12/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_25/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"Conv2D_25/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_35/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_23/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"Conv2D_22/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"Add_22/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"depthwise_11/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"Add_23/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_23/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_32/FusedBatchNormV3_model_1/model/conv2d_29/Conv2D_model_1/model/conv2d_21/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_20/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"Add_20/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_10/filter_in","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"Add_21/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"Conv2D_21/filter","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}}}},
          {"name":"model_1/model/batch_normalization_26/FusedBatchNormV3_model_1/model/depthwise_conv2d_39/depthwise_model_1/model/conv2d_17/Conv2D1/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}}}},
          {"name":"Conv2D_16/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_16/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"depthwise_8/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_17/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}}}},
          {"name":"Conv2D_17/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"336"},{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"model_1/model/batch_normalization_23/FusedBatchNormV3_model_1/model/depthwise_conv2d_39/depthwise_model_1/model/conv2d_15/Conv2D1/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"56"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Conv2D_14/filter","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"56"},{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_14/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"depthwise_7/filter_in","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"336"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"Add_15/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"336"}]}}},"dtype":{"type":"DT_FLOAT"}}},
