{
  "format": "graph-model",
  "generatedBy": "https://github.com/Udolf15/GEAR-Predictor",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"198"},{"size":"198"},{"size":"3"}]}}
      },
      "outputs":
      {
          "race_output": {"name":"Identity_2:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"5"}]}},
          "gender_output": {"name":"Identity_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"2"}]}},
          "age_output": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"7"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/age_output/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"},{"size":"7"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/age_output/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"7"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/gender_output/MatMul/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/gender_output/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_1/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_1/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_2/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_2/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_3/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"96"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_4/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_5/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"160"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_5/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"160"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_6/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/dense_2/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/dense_2/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/race_output/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"},{"size":"5"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/race_output/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"198"},{"size":"198"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Scaled","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Scaled","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Scaled","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"160"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_1/Relu","op":"_FusedConv2D","input":["input_1","StatefulPartitionedCall/model_1/conv2d_1/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_1/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_2/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_1/conv2d_1/Relu","StatefulPartitionedCall/model_1/conv2d_2/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_2/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/model_1/conv2d_2/Relu","StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Mul","StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/max_pooling2d_1/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3"],"attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","2","2","1"]}},"ksize":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_3/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_1/max_pooling2d_1/MaxPool","StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_3/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/model_1/conv2d_3/Relu","StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Mul","StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/max_pooling2d_2/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3"],"attr":{"ksize":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_4/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_1/max_pooling2d_2/MaxPool","StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_4/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/model_1/conv2d_4/Relu","StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Mul","StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/max_pooling2d_3/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"ksize":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_5/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_1/max_pooling2d_3/MaxPool","StatefulPartitionedCall/model_1/conv2d_5/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_5/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"epsilon":{"f":0}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/model_1/conv2d_5/Relu","StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Mul","StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/max_pooling2d_4/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"ksize":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model_1/conv2d_6/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model_1/max_pooling2d_4/MaxPool","StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp","StatefulPartitionedCall/model_1/conv2d_6/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Mul","op":"Mul","input":["StatefulPartitionedCall/model_1/conv2d_6/Relu","StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Scaled"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3","op":"Add","input":["StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Mul","StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Offset"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/max_pooling2d_5/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3"],"attr":{"ksize":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max","op":"Max","input":["StatefulPartitionedCall/model_1/max_pooling2d_5/MaxPool","StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max/reduction_indices"],"attr":{"Tidx":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"},"keep_dims":{"b":false}}},
          {"name":"StatefulPartitionedCall/model_1/dense_1/Relu","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max","StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_b":{"b":false},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"transpose_a":{"b":false},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model_1/dense_3/Relu","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max","StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"transpose_b":{"b":false},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}}}},
          {"name":"StatefulPartitionedCall/model_1/dense_2/Relu","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max","StatefulPartitionedCall/model_1/dense_2/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/dense_2/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"epsilon":{"f":0},"num_args":{"i":"1"},"transpose_b":{"b":false},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/age_output/BiasAdd","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/dense_1/Relu","StatefulPartitionedCall/model_1/age_output/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/age_output/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"transpose_a":{"b":false},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"transpose_b":{"b":false}}},
          {"name":"StatefulPartitionedCall/model_1/gender_output/BiasAdd","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/dense_3/Relu","StatefulPartitionedCall/model_1/gender_output/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/gender_output/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"transpose_b":{"b":false},"epsilon":{"f":0},"transpose_a":{"b":false}}},
          {"name":"StatefulPartitionedCall/model_1/race_output/BiasAdd","op":"_FusedMatMul","input":["StatefulPartitionedCall/model_1/dense_2/Relu","StatefulPartitionedCall/model_1/race_output/MatMul/ReadVariableOp","StatefulPartitionedCall/model_1/race_output/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"transpose_a":{"b":false},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"epsilon":{"f":0},"transpose_b":{"b":false}}},
          {"name":"StatefulPartitionedCall/model_1/age_output/Softmax","op":"Softmax","input":["StatefulPartitionedCall/model_1/age_output/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/gender_output/Softmax","op":"Softmax","input":["StatefulPartitionedCall/model_1/gender_output/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model_1/race_output/Softmax","op":"Softmax","input":["StatefulPartitionedCall/model_1/race_output/BiasAdd"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Identity","op":"Identity","input":["StatefulPartitionedCall/model_1/age_output/Softmax"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Identity_1","op":"Identity","input":["StatefulPartitionedCall/model_1/gender_output/Softmax"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Identity_2","op":"Identity","input":["StatefulPartitionedCall/model_1/race_output/Softmax"],"attr":{"T":{"type":"DT_FLOAT"}}}
      ],
      "library": {},
      "versions":
      {
          "producer": 808
      }
  },
  "weightsManifest":
  [
      {
          "paths": ["gear.bin"],
          "weights": [{"name":"StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp","shape":[192,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/age_output/MatMul/ReadVariableOp","shape":[256,7],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/age_output/BiasAdd/ReadVariableOp","shape":[7],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp","shape":[192,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/gender_output/MatMul/ReadVariableOp","shape":[128,2],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/gender_output/BiasAdd/ReadVariableOp","shape":[2],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_1/Conv2D/ReadVariableOp","shape":[3,3,3,32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_1/BiasAdd/ReadVariableOp","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_2/Conv2D/ReadVariableOp","shape":[3,3,32,64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_2/BiasAdd/ReadVariableOp","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_3/Conv2D/ReadVariableOp","shape":[3,3,64,96],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_3/BiasAdd/ReadVariableOp","shape":[96],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_4/Conv2D/ReadVariableOp","shape":[3,3,96,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_4/BiasAdd/ReadVariableOp","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_5/Conv2D/ReadVariableOp","shape":[3,3,128,160],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_5/BiasAdd/ReadVariableOp","shape":[160],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_6/Conv2D/ReadVariableOp","shape":[3,3,160,192],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/conv2d_6/BiasAdd/ReadVariableOp","shape":[192],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/global_max_pooling2d_1/Max/reduction_indices","shape":[2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model_1/dense_2/MatMul/ReadVariableOp","shape":[192,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/dense_2/BiasAdd/ReadVariableOp","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/race_output/MatMul/ReadVariableOp","shape":[128,5],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/race_output/BiasAdd/ReadVariableOp","shape":[5],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Scaled","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_3/FusedBatchNormV3/Offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Scaled","shape":[96],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_2/FusedBatchNormV3/Offset","shape":[96],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Scaled","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_1/FusedBatchNormV3/Offset","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Scaled","shape":[192],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_5/FusedBatchNormV3/Offset","shape":[192],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Scaled","shape":[160],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model_1/batch_normalization_4/FusedBatchNormV3/Offset","shape":[160],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}}]
      }
  ]
}